statistics-learning.org
#+TITLE: Statistics Learning
#+DESCRIPTION: Statistics Learning
#+SETUPFILE: https://luispengler.github.io/site/org-html-themes/org/theme-readtheorg.setup
#+OPTIONS: num:nil ^:{} toc:1

* Introduction
So, my mentor gave me my second task to get the most out of "An Introduction to Statistical Learning - with Applications in R" chapters 1-4, and 10. The dataset to be used is a Acorrelation between scores and hours.
+ My mentor is [[https://scholar.google.com/citations?user=cHCDiIYAAAAJ][Dr. Abhijit Sen]], and we are starting research through the project [[https://www.ndeavours.org/][Ndeavours]]
+ Keep tuned for updates into what we are doing - I don't know yet because we just started, but it will have something to do with AI.

* Notes
** Introduction Chapter
+ When we want to predict a non-numerical value, i.e. a categorical or qualitative output, the kind of problem it constitutes is known as a Classification Problem.
+ If we are not trying to predict anything, i.e. not output, the kind of problem it constitutes is known as a clustering problem - for indicated reading I will not study this
+ "No single approach will perform well in all possible applications"
+ This chapter provides useful information on the representation of math in the textbook - ref to it if needed
** Second Chapter
+ Inputs can be called predictors, independent variables, features, variables
+ Output can be called response, dependent variable
+ Relationship of input and output can be seen:
  \[Y = f(X) + \epsilon\]
+ Above, f is some fixed but unknown function of \[X_{1}, ...., X_{p}\], and \[\epsilon\] is a random error term, and has mean zero.
+ The function f may involve more than one input variable
+ Statistical learning refers to a set of approaches for estimating f.
*** Why estimate f?
+ Two main reasons: prediction and inference
+ Linear models allow for relatively simple and interpretable interference, but might not accuratly predict \[Y\]. Some non-linear models present the oppost outcome to linear ones.
**** Prediction
\[\hat{Y} = \hat{f}(X)\]
+ The formula above is used to predict the value of \[Y\]. \[\hat{f}\] represents our estimate of \[f\], and \[\hat{Y}\] represents the resulting prediction for \[Y\]. In this setting, \[\hat{f}\] is often treated as a black box, because we are not concerned with its form, as long as it accuratly predicts \[Y\].
+ The accuracy of \[\hat{Y}\] as a prediction depends on two quantities that the book calls reducible error and irreducible error; the reducible comes from the different between \[\hat{f}\] and \[f\]. This error is reducible because we can improve the accuracy of \[\hat{f}\] using a more appropriate statistical learning technique. The irreducible comes from the dependence of \[Y\] in \[\epsilon\], and this last quantity may contain unmeasured variables that are useful for predicting \[Y\], and since we didn't measure them, the \[Y\] prediction will not be at its best...
+ The book focuses on techniques for estimating \[f\] while minimazing the reducible error (because it is possible!)
**** Inference
+ It tries to understand the association between \[Y\] and \[X_{1},....,X_{p}\]. We want to understand the relationships between the response and its predictors, and it questions various aspects of this relationship.
*** How do we estimate f?
+ We want to find a function \[^{f}\] such that \[Y \approx \hat{f}(X)\] for any observation \[(X,Y)\]. Most statistical learning methods for this can be categorized as either paremetric or non-parametric.
**** Parametric
+ It makes assumptions about the form (shape) of \[f\]. Assuming, for example, it is linear, the problem gets simplified to the point where we only need to estimate the \[p + 1\] coefficients of \[\beta_{0}, \beta_{1},....,\beta_{p}\]. In summary, this model-based approach reduces the problem of estimating \[f\] down to one of estimating a set of parameters.
**** Non-parametric
+ Doesn't make assumptions about the form of \[f\], seeking an estimate that gets as close to the data points as possible without being too rough or wiggly. Although it requires a much larger number of observations than the parametrics, they have are very likely to get close to the true form of \[f\].
*** The Trade-Off Between Prediction Accuracy and Model Interpretability
+ In general, as the flexibility of a method increases, its interpretability decreases
+ If we are more interested in inference, then restrictive models are much more interpretable and better for it
+ Least squares linear regression is relatively inflexible but is quite interpretable
+ When we want to predict, it is intuitive that we think we need the most flexible model available. However, this is not always the case due to overfitting of data.

*** Regression versus Classification Problems
+ It is a tendency to refer to quantitative response problems as regression problems, and qualitative ones as classification problems. Even though we might choose a model based on the response type we have, the predictor type doesn't have that much importance, provided we coded it prior to the analysis.

*** Assessing Model Accuracy
+ There is no model that works best for every type of problem out there. Therefore, it is necessary to select the best one that works out for the specific problem you are working with, and this is one of the most challenging parts of performing statistical learning.
