html/statistics-learning.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-14 Tue 17:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Statistics Learning</title>
<meta name="author" content="Luís Spengler" />
<meta name="description" content="Statistics Learning" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://luispengler.github.io/site/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://luispengler.github.io/site/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Statistics Learning</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org90f9526">Introduction</a></li>
<li><a href="#org3a116c4">Notes</a></li>
<li><a href="#org8402827">Playing with the data - My Homework</a></li>
<li><a href="#org04dca78">My considerations</a></li>
<li><a href="#org7d0ec21">Resources</a></li>
</ul>
</div>
</div>

<div id="outline-container-org90f9526" class="outline-2">
<h2 id="org90f9526">Introduction</h2>
<div class="outline-text-2" id="text-org90f9526">
<p>
So, my mentor gave me my second task to get the most out of &ldquo;An Introduction to Statistical Learning - with Applications in R&rdquo; chapters 1-4, and 10. The dataset to be used is a Acorrelation between scores and hours.
</p>
<ul class="org-ul">
<li>My mentor is <a href="https://scholar.google.com/citations?user=cHCDiIYAAAAJ">Dr. Abhijit Sen</a>, and we are starting research through the project <a href="https://www.ndeavours.org/">Ndeavours</a></li>
<li>Keep tuned for updates into what we are doing - I don&rsquo;t know yet because we just started, but it will have something to do with AI.</li>
</ul>
</div>
</div>

<div id="outline-container-org3a116c4" class="outline-2">
<h2 id="org3a116c4">Notes</h2>
<div class="outline-text-2" id="text-org3a116c4">
</div>
<div id="outline-container-org2c0555c" class="outline-3">
<h3 id="org2c0555c">Introduction Chapter</h3>
<div class="outline-text-3" id="text-org2c0555c">
<ul class="org-ul">
<li>When we want to predict a non-numerical value, i.e. a categorical or qualitative output, the kind of problem it constitutes is known as a Classification Problem.</li>
<li>If we are not trying to predict anything, i.e. not output, the kind of problem it constitutes is known as a clustering problem - for indicated reading I will not study this</li>
<li>&ldquo;No single approach will perform well in all possible applications&rdquo;</li>
<li>This chapter provides useful information on the representation of math in the textbook - ref to it if needed</li>
</ul>
</div>
</div>
<div id="outline-container-orgb04470b" class="outline-3">
<h3 id="orgb04470b">Second Chapter</h3>
<div class="outline-text-3" id="text-orgb04470b">
<ul class="org-ul">
<li>Inputs can be called predictors, independent variables, features, variables</li>
<li>Output can be called response, dependent variable</li>
<li>Relationship of input and output can be seen:
\[Y = f(X) + \epsilon\]</li>
<li>Above, f is some fixed but unknown function of \[X_{1}, ...., X_{p}\], and \[\epsilon\] is a random error term, and has mean zero.</li>
<li>The function f may involve more than one input variable</li>
<li>Statistical learning refers to a set of approaches for estimating f.</li>
</ul>
</div>
<div id="outline-container-org419c296" class="outline-4">
<h4 id="org419c296">Why estimate f?</h4>
<div class="outline-text-4" id="text-org419c296">
<ul class="org-ul">
<li>Two main reasons: prediction and inference</li>
<li>Linear models allow for relatively simple and interpretable interference, but might not accuratly predict \[Y\]. Some non-linear models present the oppost outcome to linear ones.</li>
</ul>
</div>
<div id="outline-container-org2f1cec9" class="outline-5">
<h5 id="org2f1cec9">Prediction</h5>
<div class="outline-text-5" id="text-org2f1cec9">
<p>
\[\hat{Y} = \hat{f}(X)\]
</p>
<ul class="org-ul">
<li>The formula above is used to predict the value of \[Y\]. \[\hat{f}\] represents our estimate of \[f\], and \[\hat{Y}\] represents the resulting prediction for \[Y\]. In this setting, \[\hat{f}\] is often treated as a black box, because we are not concerned with its form, as long as it accuratly predicts \[Y\].</li>
<li>The accuracy of \[\hat{Y}\] as a prediction depends on two quantities that the book calls reducible error and irreducible error; the reducible comes from the different between \[\hat{f}\] and \[f\]. This error is reducible because we can improve the accuracy of \[\hat{f}\] using a more appropriate statistical learning technique. The irreducible comes from the dependence of \[Y\] in \[\epsilon\], and this last quantity may contain unmeasured variables that are useful for predicting \[Y\], and since we didn&rsquo;t measure them, the \[Y\] prediction will not be at its best&#x2026;</li>
<li>The book focuses on techniques for estimating \[f\] while minimazing the reducible error (because it is possible!)</li>
</ul>
</div>
</div>
<div id="outline-container-orgf2da107" class="outline-5">
<h5 id="orgf2da107">Inference</h5>
<div class="outline-text-5" id="text-orgf2da107">
<ul class="org-ul">
<li>It tries to understand the association between \[Y\] and \[X_{1},....,X_{p}\]. We want to understand the relationships between the response and its predictors, and it questions various aspects of this relationship.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgbbcb1ef" class="outline-4">
<h4 id="orgbbcb1ef">How do we estimate f?</h4>
<div class="outline-text-4" id="text-orgbbcb1ef">
<ul class="org-ul">
<li>We want to find a function \[^{f}\] such that \[Y \approx \hat{f}(X)\] for any observation \[(X,Y)\]. Most statistical learning methods for this can be categorized as either paremetric or non-parametric.</li>
</ul>
</div>
<div id="outline-container-org3b4f6ee" class="outline-5">
<h5 id="org3b4f6ee">Parametric</h5>
<div class="outline-text-5" id="text-org3b4f6ee">
<ul class="org-ul">
<li>It makes assumptions about the form (shape) of \[f\]. Assuming, for example, it is linear, the problem gets simplified to the point where we only need to estimate the \[p + 1\] coefficients of \[\beta_{0}, \beta_{1},....,\beta_{p}\]. In summary, this model-based approach reduces the problem of estimating \[f\] down to one of estimating a set of parameters.</li>
</ul>
</div>
</div>
<div id="outline-container-org3ea3110" class="outline-5">
<h5 id="org3ea3110">Non-parametric</h5>
<div class="outline-text-5" id="text-org3ea3110">
<ul class="org-ul">
<li>Doesn&rsquo;t make assumptions about the form of \[f\], seeking an estimate that gets as close to the data points as possible without being too rough or wiggly. Although it requires a much larger number of observations than the parametrics, they have are very likely to get close to the true form of \[f\].</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgbc0953d" class="outline-4">
<h4 id="orgbc0953d">The Trade-Off Between Prediction Accuracy and Model Interpretability</h4>
<div class="outline-text-4" id="text-orgbc0953d">
<ul class="org-ul">
<li>In general, as the flexibility of a method increases, its interpretability decreases</li>
<li>If we are more interested in inference, then restrictive models are much more interpretable and better for it</li>
<li>Least squares linear regression is relatively inflexible but is quite interpretable</li>
<li>When we want to predict, it is intuitive that we think we need the most flexible model available. However, this is not always the case due to overfitting of data.</li>
</ul>
</div>
</div>

<div id="outline-container-org1340320" class="outline-4">
<h4 id="org1340320">Regression versus Classification Problems</h4>
<div class="outline-text-4" id="text-org1340320">
<ul class="org-ul">
<li>It is a tendency to refer to quantitative response problems as regression problems, and qualitative ones as classification problems. Even though we might choose a model based on the response type we have, the predictor type doesn&rsquo;t have that much importance, provided we coded it prior to the analysis.</li>
</ul>
</div>
</div>

<div id="outline-container-orgbcecf4b" class="outline-4">
<h4 id="orgbcecf4b">Assessing Model Accuracy</h4>
<div class="outline-text-4" id="text-orgbcecf4b">
<ul class="org-ul">
<li>There is no model that works best for every type of problem out there. Therefore, it is necessary to select the best one that works out for the specific problem you are working with, and this is one of the most challenging parts of performing statistical learning.</li>
</ul>
</div>
