html/statistics-learning.html
<div id="outline-container-org5efcb9a" class="outline-5">
<h5 id="org5efcb9a">Measuring the Quality of Fit</h5>
<div class="outline-text-5" id="text-org5efcb9a">
<ul class="org-ul">
<li>To quantify the extent to which the predicted response value for a given observation is close to the true response for that observation we commonly use the mean squared error (MSE):</li>
</ul>
<p>
\[MSE = \frac{1}{n} \sum\limits_{i=1}^n (y_{i} - \hat{f}(x_{i}))^2\]
</p>
<ul class="org-ul">
<li>The MSE will be small if the predicted responses are very close to the true responses, and will be large for some observations that the predicted and true responses differ substantially</li>
<li>The formula shown above is computed using the training data, but in reality we don&rsquo;t really care how well our model makes predictions on training data, rather we are interested in the accuracy of the predictions that we obtain when we apply our method to previously unseen test data</li>
<li>We want to choose the method that gives the lowest test MSE, as opposed to the lowest training MSE</li>
</ul>
</div>
</div>
<div id="outline-container-org43b02c0" class="outline-5">
<h5 id="org43b02c0">Measuring the test MSE</h5>
<div class="outline-text-5" id="text-org43b02c0">
<p>
\[Ave(y_{0} - \hat{f}(x_{0}))^2\]
</p>
<ul class="org-ul">
<li>We would like to select a model for which this quantity is as small as possible</li>
<li>To do that, in some settings we may have a test dataset available, so we use that data we use the method that gives use the lowest test MSE possible</li>
<li>If there is no available test dataset, should we apply the method the minimizes the training MSE? Well, there is no guarantee that the method with the lowest training MSE will also have the lowest test MSE. Many statistical learning methods also try to minimize the training MSE, but the test MSE often ends up being much largert</li>
<li>To solve this problem, we can even use some of the training data as the testing data. This is known as cross-validation</li>
<li>As model flexibility increases, training MSE will decrease, but the test MSE may not</li>
</ul>
</div>
</div>
<div id="outline-container-org4d14cdd" class="outline-5">
<h5 id="org4d14cdd">Overfitting</h5>
<div class="outline-text-5" id="text-org4d14cdd">
<ul class="org-ul">
<li>When a given method gives a small training MSE but a large test MSE we say we are overfitting the data.</li>
<li>Our statistical learning procedure is trying to hard to find patterns in the data that don&rsquo;t exist, patterns caused by random chance rather than the true unknown function f</li>
</ul>
</div>
</div>
<div id="outline-container-org1396b0c" class="outline-5">
<h5 id="org1396b0c">The Bias-Variance Trade-Off</h5>
<div class="outline-text-5" id="text-org1396b0c">
<ul class="org-ul">
<li>In order to minimize the expected test error, we need to select a statistical learning method that simultaneously achieves low variance and low bias.</li>
<li>Variance refers to the amount \[\hat{f}\] would change if we estimated it using different training data. Ideally, the estimate for \[\hat{f}\] should not very much between training sets. If a method has high variance, then small changes in the training set can result in large changes in \[\hat{f}\]. In general, more flexible statistical methods have higher variance</li>
<li>Bias refers to the error that is introduced in approximating a real-life problem, which may be extremely complicated, by a much simpler model. Generally, more flexible statistical methods result in less bias.</li>
<li>Generalizing, as we use more flexible methods, the variance will increase and the bias will decrease. As we increase the flexibility of a class of methods, the bias tends to initially decrease faster than the variance increases, meaning the expected test MSE declines. However, at some point increasing flexibility has little impact on the bias but starts to significantly increase the variance, then the expected test MSE increases. This is known as the Bias-Variance Trade-Off.</li>
<li>Good test set performance of a statistical learning method requires low variance as well as low squared bias. It is refered to as a trade-off, because it is extremely easy to obtain a method with extremly low bias but high variance, or a method with very low variance but high bias. The challenge is finding a method for which both the variance and the squared bias are low.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc0d2eb3" class="outline-5">
<h5 id="orgc0d2eb3">The Classification Setting</h5>
<div class="outline-text-5" id="text-orgc0d2eb3">
<ul class="org-ul">
<li>Many of the concepts discussed so far (like the bias-variance trade-off) transfer over to the classification setting, with the some modifications due to the fact the \[y_{i}\] is now qualitative</li>
<li>The most common approach for quantifying the accuracy of our estimate \[\hat{f}\] is the training error rate</li>
</ul>
<p>
\[ \frac{1}{n} \sum\limits_{i=1}^n I(\hat y_{i} \neq \hat y_{i})^2\]
</p>
<ul class="org-ul">
<li>\[\hat{y}\] is the predicted class label for the \[i\]th observation using \[\hat{f}\]. \[I(\hat y_{i} \neq \hat y_{i})^2\] is an indicator variable that equals 1 if \[\hat y_{i}\] and \[\hat y_{i}\] differ, and it equals 0 if \[\hat y_{i} = \hat y_{i}\]. If \[I(\hat y_{i} \neq \hat y_{i})^2 = 0\] then ith observation was classified correctly, otherwise it was misclassified. Then, the equation above computes the fraction of incorrect classifications. Its name is training error rate, because it is applied to training data. Just like in regression setting, here we are also more interested in the predictions, therefore test error rate will be more useful.</li>
</ul>
<p>
\[Ave(I(\hat y_{0} \neq \hat y_{0}))\]
</p>
<ul class="org-ul">
<li>A good classifier is one for which the test error given by the above equation is smallest;</li>
<li>The test error given by the above equation is minimized, on average, by a very simple classifier that assigns each observation to the most likely class, given its predictor values. Simply put, if you had to estimate if X belongs to Brazil or Argentina, the frontier between two countries corresponds to what is known as Bayes decision boundary. In this boundary, the chance of belonging to either side is 50%, and if X is in Brazil, this region is assigned as &gt; 50%.</li>
<li>The Bayes classifier produces the lowest possible test error rate, called Bayes error rate, and it is analogous to the irreducible error</li>
<li>In theory we would always like to use the Bayes classifier, but for real data, we don&rsquo;t know the conditional distribution of \[Y\] given \[X\], so computing the Bayes classifier is impossible.</li>
<li>Therefore, it remains an unattainable gold standard to which we compare other methods. Many approaches try to estimate the conditional distribution of \[Y\] given \[X\], and then classify a given observation to the class with the highest estimated probability. One such method is the K-nearest neighbors (KNN) classifier.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc650e6a" class="outline-5">
<h5 id="orgc650e6a">The K-Nearest Neighbors (KNN) classifier</h5>
<div class="outline-text-5" id="text-orgc650e6a">
<ul class="org-ul">
<li>The KNN takes a parameter known as \[K\]. So if \[K=3\], in a dataset, it will get the three closest points to what you are trying to predict, and will determine whether or not what you are trying to predict belongs to a certain classification based on the classification of the three closest points (Because \[K=3\]). If two of the three points are blue, and only one is orange, the KNN will tell you the point you are trying to predict is also blue.</li>
<li>It is a very simple approach, but it can yield results very close to the Bayes classifier</li>
<li>The choice of what \[K\] equals to has drastic effect on the results obtained. If smaller, it is more flexible, and larger, less flexibile. The small K corresponds to a classifier with low bias but very high variance, a large one corresponds to higher bias but lower variance.</li>
<li>In both the regression and classification settings, choosing the correct level of flexibility is critical to the success of any statistical learning method.</li>
</ul>
</div>
</div>
</div>
</div>
