statistics-learning.org
*** Simple Linear Regression
+ A straightforward approach for predicting a quantitative response \[Y\] on the basis of a single predictor variable \[X\]. It is mathematically written as
\[Y \approx \beta_{0} + \beta_{1}X\]
+ We can also say that we are regressing Y on X
**** Estimating the Coefficients
+ When making predictions, we can rewrite the above equation as (note the \[\beta\] have hat symbols on)
\[\hat{y} = \hat\beta_{0} + \hat\beta_{1}x\]
+ The hat symbols on top of \[\beta\] mean they are unknown parameters (they can also be used to indicate predictions such as \[\hat{y}\])
+ \[\beta_{0}\] is the intercept, and \[\beta_{1}\] is the slope
+ When estimating those coefficients, we want them to be as close as possible to all n data points we have. There are a number of ways of measuring closeness, but the most common approach consists of minimizing the least squares criterion
**** Assessing the Accuracy of the Coefficient Estimates
+ If \[f\] is to approximated by a linear function, then we can write this relationship as
\[Y = \beta_{0} + \beta{1}X + \epsilon\]
+ The error term, \[\epsilon\], is a catch-all for what we miss with this simple model: the true relationship is not linear, there may be other variables that cause variation in Y, and there may be measurement error. We then assume the error term is independent of X. The model given by the eq above defines the population regression line, which is the best linear approximation to the true relationship between X and Y.
+ The least squares regression coefficient estimates (eq which i did not show here) characterize the least squares line (given by  \[\^y = \beta_{0} + \beta_{1}x\]) (note the \[\beta\] have hat symbols on)
+ In real applications, we have access to a set of observations from which we can compute the least squares line, however the population regression is unobserved
+ We can think of the least squares as an analogy to the mean of a sample. The sample is smaller than the population, therefore, deriving the mean from it is different than deriving the mean from the population. An avarage of the sample mean over many data sets, however, will be very close to the population mean. In another situation, a single estimate of the sample mean may be a substantial understimate or overstimate of the population mean. We can even calculate how far this estimate will be with the formula below
\[Var({\hat\mu}) = SE(\hat\mu)^2 = \frac{\sigma^2}{n}\]
+ This formula gives us the standard error of \[\hat\mu\], written as \[SE(\hat \mu)\]. \[\sigma\] is the standard deviation of each of the realizations of \[y_{i}\] of \[Y^2\]. This means that the standard error tells us the avarage amount that this estimate \[\hat \mu\] differs from the actual value of \[\mu\]. To compute the standard error associated with \[\hat \beta_{0}\] and \[\hat \beta_{1}\] we can use some bigger formulas which I will not write here but you can find them on the book as 3.8
+ In general, \[\sigma^2\] is not known, but can be estimated from the data. This estimate of \[\sigma\] is known as the residual standard error, and it is given by the formula
\[RSE = \sqrt{RSS/(n-2)}\]
+ We should also write \[\hat SE(\hat \beta_{1})\] to indicate that \[\sigma^2\] was estimated from the data.
+ Standard errors can be used to compute confidence intervals. A 95% confidence interval has the following property: if we take repeated samples and construct the confidence interval for each sample, 95% of the intervals will contain the true unknown value of the paramter. Of course, the greater the range of values, the higher the confidence.
+ For linear regression, the 95\% confidence interval for \[\beta_{1}\] approximately takes the form
\[\hat \beta_{1} \pm 2\cdot SE(\beta_{1})\]
+ This means that this interval has approximately a 95\% chance to contain the true value of \[beta_{1}\]. The same relation here applies for \[\hat \beta_{0}\].
+ This part of the book is addressing the hypothesis test on the coefficients, and I didn't stop to understand much of it so I am not writting it here. What I got that is important is the p-value
+ I have heard of the p-value before, and I was always curious to understand what it meant. I think I finally got a grasp of it when I read:
#+BEGIN_QUOTE
a small p-value indicates that it is unlikely to observe such a substantial association between the predictor and the response due to chance, in the absence of any real association between the predictor and the response. Hence, if we see a small p-value, then we can infer that there is an association between the predictor and the response.
#+END_QUOTE
+ To sum up, small enough p-values tell us that there is a relationship between \[X\] and \[Y\]. Typical values are 5\% or 1\%;
**** Assessing the Accuracy of the Model
+ After we determined the p-value is small enough for us to procede believing in a relationship between \[X\] and \[Y\], we will want to quantify the extent to which the model fits the data.
+ The quality of a linear regression fit is typically assessed using two related quantities: the residual standard error (RSE) and the \[R^2\] statistic
+ The RSE is the avarage amount that the response will deviate from the true regression line. This measure is considered a measure of the lack of fit of the model to the data. It attempts to calculate how far off we would be in our predictions, even if we knew exactly the values of \[\beta_{0}\] and \[\beta_{1}\]
+ In summary, if \[\hat y_{i} \approx y_{i}\] then the RSE will be small, and if \[\hat y_{i}\] is far away, then the RSE may be quite large.
+ RSE provides an absolute measure of lack of fit of the model to the data. However, it is measured in units of \[Y\], so it is not always clear what constitutes a good RSE. To solve this problem, we can look at the \[R^2\] statistic.
+ An \[R^2\] statistic close to 1 indicates that a large proportion of the variability in the response is explained by the regression, however a number closer to 0 indicates that this regression does not explain much of the variability in the response. The latter happens when the model is wrong, or the error variance \[\sigma^2\] is high, or both.
*** Multiple Linear Regression
+ We can modify our linear regression equation:
\[Y = \beta_{0} + \beta_{1}X\]
+ to now accomodate p predictors:
\[Y = \beta_{0} + \beta_{1}X_{1} = \beta_{2}X_{2} + ... + \beta_{p}X_{p}\]
**** Estimating the Regression Coefficients
+ As in linear regression, our coefficients are unknown and must be estimated. We can make the predictions modifying the last formula to:
\[\hat y = \hat \beta_{0} + \hat \beta_{1}X_{1} = \hat \beta_{2}X_{2} + ... + \hat \beta_{p}X_{p}\]
+ The parameters are estimated using the same least squares approach used in the context of linear regression
