html/statistics-learning.html

<div id="outline-container-org859054a" class="outline-3">
<h3 id="org859054a">Third Chapter</h3>
<div class="outline-text-3" id="text-org859054a">
</div>
<div id="outline-container-org14eb928" class="outline-4">
<h4 id="org14eb928">Simple Linear Regression</h4>
<div class="outline-text-4" id="text-org14eb928">
<ul class="org-ul">
<li>A straightforward approach for predicting a quantitative response \[Y\] on the basis of a single predictor variable \[X\]. It is mathematically written as</li>
</ul>
<p>
\[Y \approx \beta_{0} + \beta_{1}X\]
</p>
<ul class="org-ul">
<li>We can also say that we are regressing Y on X</li>
</ul>
</div>
<div id="outline-container-orgf69dc17" class="outline-5">
<h5 id="orgf69dc17">Estimating the Coefficients</h5>
<div class="outline-text-5" id="text-orgf69dc17">
<ul class="org-ul">
<li>When making predictions, we can rewrite the above equation as (note the \[\beta\] have hat symbols on)</li>
</ul>
<p>
\[\hat{y} = \hat\beta_{0} + \hat\beta_{1}x\]
</p>
<ul class="org-ul">
<li>The hat symbols on top of \[\beta\] mean they are unknown parameters (they can also be used to indicate predictions such as \[\hat{y}\])</li>
<li>\[\beta_{0}\] is the intercept, and \[\beta_{1}\] is the slope</li>
<li>When estimating those coefficients, we want them to be as close as possible to all n data points we have. There are a number of ways of measuring closeness, but the most common approach consists of minimizing the least squares criterion</li>
</ul>
</div>
</div>
<div id="outline-container-orgb02cb6e" class="outline-5">
<h5 id="orgb02cb6e">Assessing the Accuracy of the Coefficient Estimates</h5>
<div class="outline-text-5" id="text-orgb02cb6e">
<ul class="org-ul">
<li>If \[f\] is to approximated by a linear function, then we can write this relationship as</li>
</ul>
<p>
\[Y = \beta_{0} + \beta{1}X + \epsilon\]
</p>
<ul class="org-ul">
<li>The error term, \[\epsilon\], is a catch-all for what we miss with this simple model: the true relationship is not linear, there may be other variables that cause variation in Y, and there may be measurement error. We then assume the error term is independent of X. The model given by the eq above defines the population regression line, which is the best linear approximation to the true relationship between X and Y.</li>
<li>The least squares regression coefficient estimates (eq which i did not show here) characterize the least squares line (given by  \[\^y = \beta_{0} + \beta_{1}x\]) (note the \[\beta\] have hat symbols on)</li>
<li>In real applications, we have access to a set of observations from which we can compute the least squares line, however the population regression is unobserved</li>
<li>We can think of the least squares as an analogy to the mean of a sample. The sample is smaller than the population, therefore, deriving the mean from it is different than deriving the mean from the population. An avarage of the sample mean over many data sets, however, will be very close to the population mean. In another situation, a single estimate of the sample mean may be a substantial understimate or overstimate of the population mean. We can even calculate how far this estimate will be with the formula below</li>
</ul>
<p>
\[Var({\hat\mu}) = SE(\hat\mu)^2 = \frac{\sigma^2}{n}\]
</p>
<ul class="org-ul">
<li>This formula gives us the standard error of \[\hat\mu\], written as \[SE(\hat \mu)\]. \[\sigma\] is the standard deviation of each of the realizations of \[y_{i}\] of \[Y^2\]. This means that the standard error tells us the avarage amount that this estimate \[\hat \mu\] differs from the actual value of \[\mu\]. To compute the standard error associated with \[\hat \beta_{0}\] and \[\hat \beta_{1}\] we can use some bigger formulas which I will not write here but you can find them on the book as 3.8</li>
<li>In general, \[\sigma^2\] is not known, but can be estimated from the data. This estimate of \[\sigma\] is known as the residual standard error, and it is given by the formula</li>
</ul>
<p>
\[RSE = \sqrt{RSS/(n-2)}\]
</p>
<ul class="org-ul">
<li>We should also write \[\hat SE(\hat \beta_{1})\] to indicate that \[\sigma^2\] was estimated from the data.</li>
<li>Standard errors can be used to compute confidence intervals. A 95% confidence interval has the following property: if we take repeated samples and construct the confidence interval for each sample, 95% of the intervals will contain the true unknown value of the paramter. Of course, the greater the range of values, the higher the confidence.</li>
<li>For linear regression, the 95\% confidence interval for \[\beta_{1}\] approximately takes the form</li>
</ul>
<p>
\[\hat \beta_{1} \pm 2\cdot SE(\beta_{1})\]
</p>
<ul class="org-ul">
<li>This means that this interval has approximately a 95\% chance to contain the true value of \[beta_{1}\]. The same relation here applies for \[\hat \beta_{0}\].</li>
<li>This part of the book is addressing the hypothesis test on the coefficients, and I didn&rsquo;t stop to understand much of it so I am not writting it here. What I got that is important is the p-value</li>
<li>I have heard of the p-value before, and I was always curious to understand what it meant. I think I finally got a grasp of it when I read:</li>
</ul>
<blockquote>
<p>
a small p-value indicates that it is unlikely to observe such a substantial association between the predictor and the response due to chance, in the absence of any real association between the predictor and the response. Hence, if we see a small p-value, then we can infer that there is an association between the predictor and the response.
</p>
</blockquote>
<ul class="org-ul">
<li>To sum up, small enough p-values tell us that there is a relationship between \[X\] and \[Y\]. Typical values are 5\% or 1\%;</li>
</ul>
</div>
</div>
<div id="outline-container-org5399c9f" class="outline-5">
<h5 id="org5399c9f">Assessing the Accuracy of the Model</h5>
<div class="outline-text-5" id="text-org5399c9f">
<ul class="org-ul">
<li>After we determined the p-value is small enough for us to procede believing in a relationship between \[X\] and \[Y\], we will want to quantify the extent to which the model fits the data.</li>
<li>The quality of a linear regression fit is typically assessed using two related quantities: the residual standard error (RSE) and the \[R^2\] statistic</li>
<li>The RSE is the avarage amount that the response will deviate from the true regression line. This measure is considered a measure of the lack of fit of the model to the data. It attempts to calculate how far off we would be in our predictions, even if we knew exactly the values of \[\beta_{0}\] and \[\beta_{1}\]</li>
<li>In summary, if \[\hat y_{i} \approx y_{i}\] then the RSE will be small, and if \[\hat y_{i}\] is far away, then the RSE may be quite large.</li>
<li>RSE provides an absolute measure of lack of fit of the model to the data. However, it is measured in units of \[Y\], so it is not always clear what constitutes a good RSE. To solve this problem, we can look at the \[R^2\] statistic.</li>
<li>An \[R^2\] statistic close to 1 indicates that a large proportion of the variability in the response is explained by the regression, however a number closer to 0 indicates that this regression does not explain much of the variability in the response. The latter happens when the model is wrong, or the error variance \[\sigma^2\] is high, or both.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org077ea42" class="outline-4">
<h4 id="org077ea42">Multiple Linear Regression</h4>
<div class="outline-text-4" id="text-org077ea42">
<ul class="org-ul">
<li>We can modify our linear regression equation:</li>
</ul>
<p>
\[Y = \beta_{0} + \beta_{1}X\]
</p>
<ul class="org-ul">
<li>to now accomodate p predictors:</li>
</ul>
<p>
\[Y = \beta_{0} + \beta_{1}X_{1} = \beta_{2}X_{2} + ... + \beta_{p}X_{p}\]
</p>
</div>
<div id="outline-container-org25483a6" class="outline-5">
<h5 id="org25483a6">Estimating the Regression Coefficients</h5>
<div class="outline-text-5" id="text-org25483a6">
<ul class="org-ul">
<li>As in linear regression, our coefficients are unknown and must be estimated. We can make the predictions modifying the last formula to:</li>
</ul>
<p>
\[\hat y = \hat \beta_{0} + \hat \beta_{1}X_{1} = \hat \beta_{2}X_{2} + ... + \hat \beta_{p}X_{p}\]
</p>
<ul class="org-ul">
<li>The parameters are estimated using the same least squares approach used in the context of linear regression</li>
</ul>
</div>
</div>
