statistics-learning.org
**** Some Important Questions
1. Is at least one of the predictors \[X_{1}, X_{2}, . . . , X_{p}\] useful in predicting the response?
2. Do all the predictors help to explain Y , or is only a subset of the predictors useful?
3. How well does the model fit the data?
4. Given a set of predictor values, what response value should we predict, and how accurate is our prediction?
**** Potential Problems
+ When we fit a linear regression model to a particular data set, many problems may occur. Most common among these are the following:
1. Non-linearity of the response-predictor relationships
2. Correlation of error terms.
3. Non-constant variance of error terms.
4. Outliers.
5. High-leverage points.
6. Collinearity.

** Fourth Chapter - Classification
+ Qualitative variables are often referred to as categorical
+ This chapter describes approaches for predicting qualitative responses, a process known as classification
+ Predicting a qualitative response can be referred to as classifying that observation
+ There are many possible classification techniques, or classifiers, that one might use to predict a qualitative response. We will discuss some widely-used classifiers like logistic regression, linear discriminant analysis, quadratic disciminant analysis, naive Bayes, and K-nearest neighbors
*** An Overview of Classification
+ They occur often (maybe more often than regression problems). The book gives the following examples:
1. A person arrives at the emergency room with a set of symptoms that could possibly be attributed to one of three medical conditions. Which of the three conditions does the individual have?
2. An online banking service must be able to determine whether or not a transaction being performed on the site is fraudulent, on the basis of the user’s IP address, past transaction history, and so forth.
3. On the basis of DNA sequence data for a number of patients with  and without a given disease, a biologist would like to figure out which DNA mutations are deleterious (disease-causing) and which are not.
*** Why not Linear Regression?
+ In short, there is no natural way to convert a qualitative response variable with more than two levels into a quantiative response that is ready for linear regression. In N.1 (a person arrives...), there is three medical conditions to be assigned, meaning three levels. It will not work appropriatly with linear regression, since in this case a different ordering of the disease mean a completely different model -> A regression method cannot accomodate a qualitative response with more than two classes
+ A regression method will not provide meaningful estimates of \[Pr(Y|X)\], even with just two classes. So it is preferable to use a classification method that was made for qualitative response values
*** Logistic Regression
+ Rather than modeling a yes or no response directly, logistic regression models the probability that Y belongs to a particular category
**** The Logistic Model
+ Any time a straight line is fit to a binary response that is codad as 0 or 1, in principle we can always predict \[p(X) < 0\] for some values of \[X\] and \[p(X) > 1\] for others. To avoid this, we must model \[p(X)\] using a function that gives outputs between 0 and 1 for all values of X. Many functions meet this description, and in logistic regression we have the logistic function for this:
\[p(X) = \frac{e^{\beta_{0} + \beta_{1}X}}{1 + e^{\beta_{0} + \beta_{1}X}}\]
+ To fit the model we use a method called maximum likelihood. Its intuition is as follows:

#+BEGIN_QUOTE
we seek estimates for \[\beta_{0}\] and \[\beta_{1}\] such that the predicted probability \[\hat p(x_{i})\] of default for each individual, using the logistic function, corresponds as closely as possible to the individual's observed default status. In other words, we try to find \[\hat \beta_{0}\] and \[\hat \beta_{1}\] such that plubbing these estimates into the model for \[p(X)\], given in the logistic function, yields a number close to one for all individuals who defaulted, and a number close to zero for all individuals who did not.
#+END_QUOTE

+ Maximum likelihood is a very general approach. In the linear regression setting, the least squares approach is a special case of maximum likelihood
**** Making Predictions
+ To fit a model that uses a qualitative predictor, we simple create a dummy variable that takes on a value for 1 is positive and 0 if negative
*** Multinomial Logistic Regression
+ The logistic regression approach we have seen only allows for K=2 classes for the response variable, but it is possible to extend this. Known as Multinomial Logistic Regression, we choose one of the response variable to be the baseline. Consequently, a different baseline will result in different coefficients, but its prediction will still be the same
+ Another approach is called softmax coding. Instead of choosing a baseline, we treat all K classes symmetrically
*** Generative Models for Classification
+ We can't always use logistic regression because when there is substantial separation between two classes, the parameter estimates for the logistic regression model become unstable. If the distribution of the predictors X is approximately normal in each of the classes and the sample size is small, then there might me other approaches more accurate than logistic regression
**** Quadratic Discriminant Analysi
+ The choice in usage between LDA and QDA comes from the bias-variance trade-off. The LDA has smaller variance but bigger bias, contrary to the QDA.
**** Naive Bayes
+ It assumes that the p covariates are independent within each class. Whether we believe it or not, and even though this not true in most settings (that they are independent), it often leads to pretty good results. To see the dependency of the p covariates, we need huge amounts of data, which is not always available. Therefore, assuming no relationship ends up being the best option.
*** A comparison of classification models
+ Any classifier with a linear decision boundary is a special case of naive Bayes. This means LDA is a special case of naive Bayes
+ Because KNN is completely non-parametric, we can expect this approach to dominate LDA and logistic regression when the decision boundary is highly non-linear, provided that n is very large and p is small
+ In settings where the decision boundary is non-linear but n is only modest, or p is not very small, then QDA may be preferred to KNN. That is due to the fact QDA can provide a non-linear decision boundary while taking advantage of a parametric form, which means that it requires a smaller sample size for accurate classification, relative to KNN
