html/statistics-learning.html
<div id="outline-container-orga5a542e" class="outline-5">
<h5 id="orga5a542e">Some Important Questions</h5>
<div class="outline-text-5" id="text-orga5a542e">
<ol class="org-ol">
<li>Is at least one of the predictors \[X_{1}, X_{2}, . . . , X_{p}\] useful in predicting the response?</li>
<li>Do all the predictors help to explain Y , or is only a subset of the predictors useful?</li>
<li>How well does the model fit the data?</li>
<li>Given a set of predictor values, what response value should we predict, and how accurate is our prediction?</li>
</ol>
</div>
</div>
<div id="outline-container-org9d20fce" class="outline-5">
<h5 id="org9d20fce">Potential Problems</h5>
<div class="outline-text-5" id="text-org9d20fce">
<ul class="org-ul">
<li>When we fit a linear regression model to a particular data set, many problems may occur. Most common among these are the following:</li>
<li>Non-linearity of the response-predictor relationships</li>
<li>Correlation of error terms.</li>
<li>Non-constant variance of error terms.</li>
<li>Outliers.</li>
<li>High-leverage points.</li>
<li>Collinearity.</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orgeb12c76" class="outline-3">
<h3 id="orgeb12c76">Fourth Chapter - Classification</h3>
<div class="outline-text-3" id="text-orgeb12c76">
<ul class="org-ul">
<li>Qualitative variables are often referred to as categorical</li>
<li>This chapter describes approaches for predicting qualitative responses, a process known as classification</li>
<li>Predicting a qualitative response can be referred to as classifying that observation</li>
<li>There are many possible classification techniques, or classifiers, that one might use to predict a qualitative response. We will discuss some widely-used classifiers like logistic regression, linear discriminant analysis, quadratic disciminant analysis, naive Bayes, and K-nearest neighbors</li>
</ul>
</div>
<div id="outline-container-org794d59e" class="outline-4">
<h4 id="org794d59e">An Overview of Classification</h4>
<div class="outline-text-4" id="text-org794d59e">
<ul class="org-ul">
<li>They occur often (maybe more often than regression problems). The book gives the following examples:</li>
<li>A person arrives at the emergency room with a set of symptoms that could possibly be attributed to one of three medical conditions. Which of the three conditions does the individual have?</li>
<li>An online banking service must be able to determine whether or not a transaction being performed on the site is fraudulent, on the basis of the user’s IP address, past transaction history, and so forth.</li>
<li>On the basis of DNA sequence data for a number of patients with  and without a given disease, a biologist would like to figure out which DNA mutations are deleterious (disease-causing) and which are not.</li>
</ul>
</div>
</div>
<div id="outline-container-org18f464c" class="outline-4">
<h4 id="org18f464c">Why not Linear Regression?</h4>
<div class="outline-text-4" id="text-org18f464c">
<ul class="org-ul">
<li>In short, there is no natural way to convert a qualitative response variable with more than two levels into a quantiative response that is ready for linear regression. In N.1 (a person arrives&#x2026;), there is three medical conditions to be assigned, meaning three levels. It will not work appropriatly with linear regression, since in this case a different ordering of the disease mean a completely different model -&gt; A regression method cannot accomodate a qualitative response with more than two classes</li>
<li>A regression method will not provide meaningful estimates of \[Pr(Y|X)\], even with just two classes. So it is preferable to use a classification method that was made for qualitative response values</li>
</ul>
</div>
</div>
<div id="outline-container-orga3f7b11" class="outline-4">
<h4 id="orga3f7b11">Logistic Regression</h4>
<div class="outline-text-4" id="text-orga3f7b11">
<ul class="org-ul">
<li>Rather than modeling a yes or no response directly, logistic regression models the probability that Y belongs to a particular category</li>
</ul>
</div>
<div id="outline-container-org239d91f" class="outline-5">
<h5 id="org239d91f">The Logistic Model</h5>
<div class="outline-text-5" id="text-org239d91f">
<ul class="org-ul">
<li>Any time a straight line is fit to a binary response that is codad as 0 or 1, in principle we can always predict \[p(X) < 0\] for some values of \[X\] and \[p(X) > 1\] for others. To avoid this, we must model \[p(X)\] using a function that gives outputs between 0 and 1 for all values of X. Many functions meet this description, and in logistic regression we have the logistic function for this:</li>
</ul>
<p>
\[p(X) = \frac{e^{\beta_{0} + \beta_{1}X}}{1 + e^{\beta_{0} + \beta_{1}X}}\]
</p>
<ul class="org-ul">
<li>To fit the model we use a method called maximum likelihood. Its intuition is as follows:</li>
</ul>

<blockquote>
<p>
we seek estimates for \[\beta_{0}\] and \[\beta_{1}\] such that the predicted probability \[\hat p(x_{i})\] of default for each individual, using the logistic function, corresponds as closely as possible to the individual&rsquo;s observed default status. In other words, we try to find \[\hat \beta_{0}\] and \[\hat \beta_{1}\] such that plubbing these estimates into the model for \[p(X)\], given in the logistic function, yields a number close to one for all individuals who defaulted, and a number close to zero for all individuals who did not.
</p>
</blockquote>

<ul class="org-ul">
<li>Maximum likelihood is a very general approach. In the linear regression setting, the least squares approach is a special case of maximum likelihood</li>
</ul>
</div>
</div>
<div id="outline-container-org2f8db22" class="outline-5">
<h5 id="org2f8db22">Making Predictions</h5>
<div class="outline-text-5" id="text-org2f8db22">
<ul class="org-ul">
<li>To fit a model that uses a qualitative predictor, we simple create a dummy variable that takes on a value for 1 is positive and 0 if negative</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb09751a" class="outline-4">
<h4 id="orgb09751a">Multinomial Logistic Regression</h4>
<div class="outline-text-4" id="text-orgb09751a">
<ul class="org-ul">
<li>The logistic regression approach we have seen only allows for K=2 classes for the response variable, but it is possible to extend this. Known as Multinomial Logistic Regression, we choose one of the response variable to be the baseline. Consequently, a different baseline will result in different coefficients, but its prediction will still be the same</li>
<li>Another approach is called softmax coding. Instead of choosing a baseline, we treat all K classes symmetrically</li>
</ul>
</div>
</div>
<div id="outline-container-orga48811d" class="outline-4">
<h4 id="orga48811d">Generative Models for Classification</h4>
<div class="outline-text-4" id="text-orga48811d">
<ul class="org-ul">
<li>We can&rsquo;t always use logistic regression because when there is substantial separation between two classes, the parameter estimates for the logistic regression model become unstable. If the distribution of the predictors X is approximately normal in each of the classes and the sample size is small, then there might me other approaches more accurate than logistic regression</li>
</ul>
</div>
<div id="outline-container-orgcd68056" class="outline-5">
<h5 id="orgcd68056">Quadratic Discriminant Analysi</h5>
<div class="outline-text-5" id="text-orgcd68056">
<ul class="org-ul">
<li>The choice in usage between LDA and QDA comes from the bias-variance trade-off. The LDA has smaller variance but bigger bias, contrary to the QDA.</li>
</ul>
</div>
</div>
<div id="outline-container-org057065b" class="outline-5">
<h5 id="org057065b">Naive Bayes</h5>
<div class="outline-text-5" id="text-org057065b">
<ul class="org-ul">
<li>It assumes that the p covariates are independent within each class. Whether we believe it or not, and even though this not true in most settings (that they are independent), it often leads to pretty good results. To see the dependency of the p covariates, we need huge amounts of data, which is not always available. Therefore, assuming no relationship ends up being the best option.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8bfa62f" class="outline-4">
<h4 id="org8bfa62f">A comparison of classification models</h4>
<div class="outline-text-4" id="text-org8bfa62f">
<ul class="org-ul">
<li>Any classifier with a linear decision boundary is a special case of naive Bayes. This means LDA is a special case of naive Bayes</li>
<li>Because KNN is completely non-parametric, we can expect this approach to dominate LDA and logistic regression when the decision boundary is highly non-linear, provided that n is very large and p is small</li>
<li>In settings where the decision boundary is non-linear but n is only modest, or p is not very small, then QDA may be preferred to KNN. That is due to the fact QDA can provide a non-linear decision boundary while taking advantage of a parametric form, which means that it requires a smaller sample size for accurate classification, relative to KNN</li>
</ul>
</div>
