statistics-learning.org
**** Generalized Linear Models in Greater Generality
+ For linear regression, we typically assume that Y follows a Gaussian or normal distribution. For logistic regression, we assume that Y follows a Bernoulli distribution. For Poisson regression (not discussed on these notes), we assume that Y follows a Poisson distribution
+ These distributions above are all members of a wider class of distributions known as exponential family. There is also exponential distribution, Gamma distribution, and the negative binominal distribution as known members of this family.
+ Linear regression, logistic regression, and Poisson are three examples of generalized linear models (GLMs).

** Tenth Chapter - Deep Learning
+ A fundamental basis of deep learning is the neural network
+ They became famous in the late 80s, but the hype was a bit lost because of SVMs, boosting, random forests. While these methods were more automatic, neural networks required a lot of tinkering. The new methods also outperformed poorly-trained neural networks.
+ Neural networks resurfaced after 2010 with the name of deep learning
*** Single Layer Neural Networks
+ A neural network takes an input of \[p\] variables \[X = (X_{1}, X_{2},...,X_{p})\] and builds a nonlinear function \[f(X)\] to predict the response \[Y\].
+ I didn't get much of the math :(, but I saw that there was a nonlinear transformation from the linear functions at \[X_{p}\]
*** Multilayer Neural Networks
#+BEGIN_QUOTE
Modern neural networks typically have more than one hidden layer, and often many units per layer. In theory a single hidden layer with a large number of units has the ability to approximate most functions. However, the learning task of discovering a good solution is made much easier with multiple layers each of modest size.
#+END_QUOTE
*** Convolutional Neural Networks
+ CNNs mimic to some degree how humans classify images, by recognizing specific features or patterns anywhere in the image that distinguish each particular object class
**** Convolution Layers
#+BEGIN_QUOTE
A convolution layer is made up of a large number of convolution filters, each of which is a template that determines whether a particular local feature is present in an image. A convolution filter relies on a very simple operation, called a convolution, which basically amounts to repeatedly multiplying matrix elements and then adding the results.
#+END_QUOTE
+ The convolution image highlights regions of the original image that resemble the convolution filter
+ In a convolution layer, we use a whole bank of filters to pick out a variety of differently-oriented edges and shapes in the image.
+ Using predefined filters is common in image processing, but with CNNs the filters are learned for the specific classification task
**** Pooling Layers
+ A pooling layer provides a way to condense a large image into a smaller summary image
**** Data Augmentation
+ Each training image is replicated many times, with each replicate randomly distorted in a natural way such that human recognition is unaffected
+ This is a way of increasing the training set considerably with somewhat different examples, and thus protect against overfitting

* Playing with the data - My Homework
#+BEGIN_QUOTE
1) HOURS AND SCORE...hour is input and score is output (useful for linear regression regression and non linear regression too)
2) hours,score,conce.level...here take hours and concentration level as input and score is the output (useful for multi linear regression)
3) last one is for classification where you use input hurs,scores and concentration level to predict if someone passes the physics exam or not (classification problem)

Play around as much as you can. Make sure to visualize data before fitting them into the ML model. Note that data is always split into a train and test data set. The model is trained using a train dataset and the power of the model is checked using a test dataset.
#+END_QUOTE
+ In 3, I think logistic regression and LDA would be nice models, maybe QDA and naive Bayes if it is moderatly non-linear

* My considerations
+ This book is primarly aimed at advanced undegraduate students, and while I understood most of the main ideas in the chapters I read, I feel like I couldn't get the most of math due to my non-existant college background

* Resources
+ Book: An Introduction to Statistical Learning - with Applications in R
