html/statistics-learning.html
<div id="outline-container-orga1437c9" class="outline-5">
<h5 id="orga1437c9">Generalized Linear Models in Greater Generality</h5>
<div class="outline-text-5" id="text-orga1437c9">
<ul class="org-ul">
<li>For linear regression, we typically assume that Y follows a Gaussian or normal distribution. For logistic regression, we assume that Y follows a Bernoulli distribution. For Poisson regression (not discussed on these notes), we assume that Y follows a Poisson distribution</li>
<li>These distributions above are all members of a wider class of distributions known as exponential family. There is also exponential distribution, Gamma distribution, and the negative binominal distribution as known members of this family.</li>
<li>Linear regression, logistic regression, and Poisson are three examples of generalized linear models (GLMs).</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org2b2e242" class="outline-3">
<h3 id="org2b2e242">Tenth Chapter - Deep Learning</h3>
<div class="outline-text-3" id="text-org2b2e242">
<ul class="org-ul">
<li>A fundamental basis of deep learning is the neural network</li>
<li>They became famous in the late 80s, but the hype was a bit lost because of SVMs, boosting, random forests. While these methods were more automatic, neural networks required a lot of tinkering. The new methods also outperformed poorly-trained neural networks.</li>
<li>Neural networks resurfaced after 2010 with the name of deep learning</li>
</ul>
</div>
<div id="outline-container-orgfd3389c" class="outline-4">
<h4 id="orgfd3389c">Single Layer Neural Networks</h4>
<div class="outline-text-4" id="text-orgfd3389c">
<ul class="org-ul">
<li>A neural network takes an input of \[p\] variables \[X = (X_{1}, X_{2},...,X_{p})\] and builds a nonlinear function \[f(X)\] to predict the response \[Y\].</li>
<li>I didn&rsquo;t get much of the math :(, but I saw that there was a nonlinear transformation from the linear functions at \[X_{p}\]</li>
</ul>
</div>
</div>
<div id="outline-container-org0eccab5" class="outline-4">
<h4 id="org0eccab5">Multilayer Neural Networks</h4>
<div class="outline-text-4" id="text-org0eccab5">
<blockquote>
<p>
Modern neural networks typically have more than one hidden layer, and often many units per layer. In theory a single hidden layer with a large number of units has the ability to approximate most functions. However, the learning task of discovering a good solution is made much easier with multiple layers each of modest size.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org80832aa" class="outline-4">
<h4 id="org80832aa">Convolutional Neural Networks</h4>
<div class="outline-text-4" id="text-org80832aa">
<ul class="org-ul">
<li>CNNs mimic to some degree how humans classify images, by recognizing specific features or patterns anywhere in the image that distinguish each particular object class</li>
</ul>
</div>
<div id="outline-container-orgaf6fac9" class="outline-5">
<h5 id="orgaf6fac9">Convolution Layers</h5>
<div class="outline-text-5" id="text-orgaf6fac9">
<blockquote>
<p>
A convolution layer is made up of a large number of convolution filters, each of which is a template that determines whether a particular local feature is present in an image. A convolution filter relies on a very simple operation, called a convolution, which basically amounts to repeatedly multiplying matrix elements and then adding the results.
</p>
</blockquote>
<ul class="org-ul">
<li>The convolution image highlights regions of the original image that resemble the convolution filter</li>
<li>In a convolution layer, we use a whole bank of filters to pick out a variety of differently-oriented edges and shapes in the image.</li>
<li>Using predefined filters is common in image processing, but with CNNs the filters are learned for the specific classification task</li>
</ul>
</div>
</div>
<div id="outline-container-org8edac9e" class="outline-5">
<h5 id="org8edac9e">Pooling Layers</h5>
<div class="outline-text-5" id="text-org8edac9e">
<ul class="org-ul">
<li>A pooling layer provides a way to condense a large image into a smaller summary image</li>
</ul>
</div>
</div>
<div id="outline-container-org84077ce" class="outline-5">
<h5 id="org84077ce">Data Augmentation</h5>
<div class="outline-text-5" id="text-org84077ce">
<ul class="org-ul">
<li>Each training image is replicated many times, with each replicate randomly distorted in a natural way such that human recognition is unaffected</li>
<li>This is a way of increasing the training set considerably with somewhat different examples, and thus protect against overfitting</li>
</ul>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org8402827" class="outline-2">
<h2 id="org8402827">Playing with the data - My Homework</h2>
<div class="outline-text-2" id="text-org8402827">
<blockquote>
<ol class="org-ol">
<li>HOURS AND SCORE&#x2026;hour is input and score is output (useful for linear regression regression and non linear regression too)</li>
<li>hours,score,conce.level&#x2026;here take hours and concentration level as input and score is the output (useful for multi linear regression)</li>
<li>last one is for classification where you use input hurs,scores and concentration level to predict if someone passes the physics exam or not (classification problem)</li>
</ol>

<p>
Play around as much as you can. Make sure to visualize data before fitting them into the ML model. Note that data is always split into a train and test data set. The model is trained using a train dataset and the power of the model is checked using a test dataset.
</p>
</blockquote>
<ul class="org-ul">
<li>In 3, I think logistic regression and LDA would be nice models, maybe QDA and naive Bayes if it is moderatly non-linear</li>
</ul>
</div>
</div>

<div id="outline-container-org04dca78" class="outline-2">
<h2 id="org04dca78">My considerations</h2>
<div class="outline-text-2" id="text-org04dca78">
<ul class="org-ul">
<li>This book is primarly aimed at advanced undegraduate students, and while I understood most of the main ideas in the chapters I read, I feel like I couldn&rsquo;t get the most of math due to my non-existant college background</li>
</ul>
</div>
</div>

<div id="outline-container-org7d0ec21" class="outline-2">
<h2 id="org7d0ec21">Resources</h2>
<div class="outline-text-2" id="text-org7d0ec21">
<ul class="org-ul">
<li>Book: An Introduction to Statistical Learning - with Applications in R</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Luís Spengler</p>
<p class="date">Created: 2023-03-14 Tue 17:56</p>
</div>
</body>
</html>
